Стм-ка просыпается по будильнику каждую минуту.
Будет есп-шку на 30 сек. Есп-шка пытается установить связь с сервером, 
если ок, запрашивает по уарту показания счетчиков воды у стм-ки.
Если ок, есп-шка передает по уарту команду - установить будильник 
на другое время, можно раз в сутки (сейчас на две минуты). 
Есп - передает команду - сбросить текущее время в ноль.
Плюс  esp -передает команду - выключить себе питание.
Если пакет не прошел до сервера - стм-ка каждую минуту будет есп-шку 
на 30 сек и ждёт успешной отправки пакета. Если отправка пакета прошла 
успешно, итнтервал будильника - меняется, и стм-ка будит есп-шку - через 
другой интервал времени, который прилетел ей от esp-шки.
Установил время антидребезга на 3000 ms.
Срабатывание только по заднему фронту входных сигналов (переход: 1 -> 0)

//===================================
Пусть питание от 1 АКБ 3000mA/H V= 3.7V.
Если отправлять посылку каждые 2 часа, то за 45 дней это скушает 300мA/H ёмкости АКБ.
(1 посылка 15 сек, с током 130 мА).
При этом, если статическое потребление = 2.5 мА, 
то за 45 дней, статическое потребление скушает 2700 mA/H ёмкости АКБ.

Длительность одной посылки 15 сек, потребление тока 130 mA (3.7V)
При ёмкости АКБ 3000mA/H (V= 3.7V) без статического потребления, можно отправить 5538 посылок. 
//===================================